import { Component } from '@angular/core';
import { Level, LEVELS, Report, SamModel } from 'src/app/report.model';

@Component({
  selector: 'app-full-report',
  templateUrl: './full-report.component.html',
  styleUrls: ['./full-report.component.scss']
})
export class FullReportComponent {
  note: {[level: string]: string} = {
    'التأسيس':     "هذه السمة غير موجودة وتحتاج إلى تأسيس كخطوة أولى، ثم تمكين الجمعية في ممارسة هذه السمة.",
    'الممارسة': "هذه السمة غير موجودة وتحتاج إلى تأسيس كخطوة أولى، ثم تمكين الجمعية في ممارسة هذه السمة.",
    'التطوير': "السمة موجودة، وفاعلة جزئياً. وتحتاج الجمعية في هذه المرحلة إلى تعزيز قدراتها في ممارسة هذه السمة بشكل أفضل.",
    'الاحترافية': "السمة موجودة وفاعلة أو مطبقة لدى الجمعية، وتحتاج الجمعية إلى تمكينها للمحافظة على هذه السمة."

}

  level:Level = 'الاحترافية'
  report = REPORT
  allSections = REPORT.evaluations


  getSectionNote(section:SamModel):string{
    return this.note[this.report.result]
  }

  getElementValues(values: unknown): string[] {
    return values as string[]
  }

  getLevelIdx = (level: Level) => LEVELS.indexOf(level)

  evaluationItems: string[] = [
    "مرحلة التأسيس",
    "مرحلة الممارسة",
    "مرحلة التطور",
    "مرحلة الإحترافية"
  ]
}

const REPORT: Report = {
  companyName: 'منظمة كربوج زقزقلو',
  result: 'الاحترافية',
  percentageResult: 78,
  evaluations: [
    {
      name: 'leadership',
      image: 'assets/images/evaluation1.png',
      level: 'التأسيس',
      recommendation: 'l2',


      analysis: {
        'التوجه والقيم': ['تعمل وفق رسالة ورؤية مفزة', 'تعمل وفق قيم مؤثرة'],
        'الإدارة والاستراتيجة': ['تعمل وفق نظام مؤشرات للأداء', 'تعمل وفق خطة استراتيجية'],
        'الحوكمة': ['تعمل وفق سياسات حوكمة فاعلة', 'تمتلك مجلس إدارة فعال']
      }
    },
    {
      name: 'solutionDesign',
      image: 'assets/images/evaluation2.png',
      level: 'الاحترافية',
      recommendation: 'l2',
 

      analysis: {
        'تقييم الاحتياجات المستقبلية للمستقبل': ['تستخدم طرقاً متكاملة لفهم احتياجات المجتمع. ', 'النظرة الشمولية للاحتياجات الوطنية'],
        'الابتكار المجتمعي': ['تطوّر المنظمة حلولها مع المجتمع المستهدف ', 'تختبر الحلول مع المجتمع قبل الشروع في إطلاق البرامج '],
        'تصميم البرامج والمشاريع المجتمعية': ['تستخدم منهجيات احترافية في تخطيط المشاريع التنموية ']
      },
    },
    {
      name: 'managementAndOperations',
      analysis: {
        "الموارد البشرية": ["لدى المنظمة ما تحتاجه من الكفاءات الإدارية لتحقيق أهدافها. ", "تعمل المنظمة وفق بناء مؤسسي واضح. ", "تنوع الكادر الإداري "],
        "الإدارة المالية": ["تقوم المنظمة بتوثيق بياناتها المالية. ", "توائم المنظمة خطتها المالية مع الخطة التشغيلية. ", "تحقق كفاءة في الإنفاق الإداري. "],
        "التخطيط التشغيلي ": ["تضع المنظمة خطة تشغيلية لأعمالها لمدة عام. ", "تضع خطة متابعة تنفيذ الخطة من خلال مؤشرات أداء. "],
        "تضع خطة متابعة تنفيذ الخطة من خلال مؤشرات أداء.": ["تمتلك المنظمة بيئة عمل مناسبة لحجم أعمالها. ", "تمتلك بنية تقنية تلبي احتياج وحجم أعمالها. "]
      },
      level: 'التطوير',
      recommendation: 'l2',


      image: 'assets/images/evaluation3.png'
    },
    {
      name: 'socialActivation',
      analysis: {
        "التكامل مع الشركاء ": ["تنفذ مشاريع مشتركة مع شركاء (مكمّلين أو متشابهين) ", "تنوع المنظمة شركائها "],
        "الدعم من المجتمع ": ["تتواصل بفاعلية مع مختلف فئات المجتمع ", "تستخدم منصات رقمية تتناسب مع الفئة المستهدفة "],
        "إدارة التطوع ": ["تستثمر المتطوعين ", "يستفيد المتطوعون من عملهم مع المنظمة "]
      },
      recommendation: 'l2',
   
      level: 'التطوير',
      image: 'assets/images/evaluation4.png'
    },
    {
      name: 'sustainability',
      analysis: {
        "إدارة العلاقة مع المانحين ": [
          "تتوافق المنظمة مع توجهات المانحين. ",
          "للمنظمة علاقة مستقرة مع المانحين. "],
        "استدامة مصادر التمويل ": ["تنوع مصادر الدعم الخارجي ", "تمتلك استثمارات وأوقاف "],
        "إدارة الاستدامة ": ["تضع الاستدامة كتوجه استراتيجي ", "إدارة مخاطر الاستدامة "]
      },
      recommendation: 'l2',
 

      level: 'التطوير',
      image: 'assets/images/evaluation5.png'
    },
    {
      name: 'socialImpact',
      analysis: {
        "المتابعة والتقييم والتعلم والمساءلة ": [
          "استخدام المتابعة والتقييم في تنفيذ المشاريع المجتمعية والتعلم منها",
          "إدارة الشكاوى"
        ],
        "إدارة الأثر ": ["تنفيذ قياس الأثر الاجتماعي ", "الموازنة بين الأثر والأداء المالي "]
      },
      recommendation: 'l2',

      level: 'التطوير',
      image: 'assets/images/evaluation6.png'
    }
  ]
}